In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import requests
import seaborn as sns

#Breakdown of Salary and expenditure to display overall exppenditure and disposable income

In [2]:
Bills = [
    {'Name' : 'Karl' ,'Rent' : 900, 'Electricity' : 125, 'Internet' : 30, 'Car Insurance' : 75, 'Bins' : 15, 'Cost of Living':900},
    {'Name' : 'Hanna', 'Rent' : 900, 'Electricity' : 125, 'Car Insurance' : 75,'Health Insurance' : 55, 'Cost of Living' : 900}
]
df= pd.DataFrame(Bills)
df

,Name,Rent,Electricity,Internet,Car Insurance,Bins,Cost of Living,Health Insurance
0,Karl,900,125,30.0,75,15.0,900,NaN
1,Hanna,900,125,NaN,75,NaN,900,55.0

In [ ]:
df = df.fillna(0)
df.set_index('Name', inplace=True)

In [ ]:
for ind, row in df.iterrows():
    df.loc[ind,"Total Expenditure"] = row['Rent'] + row['Electricity'] + row['Internet'] + row['Car Insurance'] + row['Bins'] + row['Health Insurance']+ row['Cost of Living']
df

In [ ]:
np.array(df)

In [ ]:
#Karls Income = 51000 and Hannas Income = 59000

income = float(input("please enter your taxable income: "))

tax = 0.0 
if income <= 35300:
    tax = income *.2
else:
    tax = 7060 + .4 * (income - 35300)
    
    remainder = income - tax
    print(tax)
    print(remainder)

In [ ]:
Kincome = 37660
Hincome = 42460

In [ ]:
def div12(x):
    return x / 12
Kincome = div12(Kincome)
Hincome = div12(Hincome)

In [ ]:
df.insert(loc=7, column= "Wage", value=[Kincome,Hincome])
df

In [ ]:
df.insert(loc=9, column= "Remainder", value= df['Wage'] - df['Total Expenditure'])
df

In [ ]:
#When Salary, Tax, Bills and other expenditure are accounted for there is 1093 + 1483 leftover which combined would leave just over 2500 a month to save.